In [2]:
import pandas as pd
import numpy as np

In [3]:
attendance_data = pd.read_csv("D:\\APP\\NITW\\Applications using Python\\Assignment_1\\Problem1\\SECTION1.csv", header=None)

In [4]:
attendance_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,5,School of Computing Science & Engineering,B.Tech/B.Tech (Hons) Computer Science Engineering,Sem VI,EMPS3012,16SCSE101002,NISHCHHAL SHARMA,15/03/2019,2G-L48-2G-2G-L48-L48,04:00-04:50,2,1
1,19,School of Computing Science & Engineering,B.Tech/B.Tech (Hons) Computer Science Engineering,Sem VI,EMPS3012,16SCSE101002,NISHCHHAL SHARMA,12/03/2019,L30-6P3HR-6P4HR-6P3HR-B2-6P4HR-B2-B2-L30-L30,02:20-03:10,2,1
2,20,School of Computing Science & Engineering,B.Tech/B.Tech (Hons) Computer Science Engineering,Sem VI,EMPS3012,16SCSE101002,NISHCHHAL SHARMA,08/03/2019,12P4HR-12P4HR-TU10-L47-L47-TU10-L47-TU10,03:10-04:00,2,1
3,21,School of Computing Science & Engineering,B.Tech/B.Tech (Hons) Computer Science Engineering,Sem VI,EMPS3012,16SCSE101002,NISHCHHAL SHARMA,12/03/2019,A2-6P4HR-L29-L29-6P3HR-6P3HR-L29-A2-A2-6P4HR,01:30-02:20,2,1
4,25,School of Computing Science & Engineering,B.Tech/B.Tech (Hons) Computer Science Engineering,Sem VI,EMPS3012,16SCSE101002,NISHCHHAL SHARMA,15/03/2019,TU10-L47-L47-12P4HR-12P4HR-TU10-TU10-L47,03:10-04:00,2,1

In [43]:
attendance_data.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [5]:
attendance_data.describe()

                 0       10           11
count   1120.000000  1120.0  1120.000000
mean    6327.863393     2.0     0.550000
std     3651.341471     0.0     0.504847
min        5.000000     2.0     0.000000
25%     3192.000000     2.0     0.000000
50%     6340.000000     2.0     1.000000
75%     9493.000000     2.0     1.000000
max    12657.000000     2.0     2.000000

In [6]:
dateCols = attendance_data[7].unique()

In [7]:
dateCols

array(['15/03/2019', '12/03/2019', '08/03/2019', '22/03/2019',
       '26/03/2019', '12/02/2019', '15/02/2019', '29/03/2019',
       '02/04/2019', '29/01/2019', '26/02/2019'], dtype=object)

In [8]:
np.sum(attendance_data.isnull())     #There is no null data

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
dtype: int64

In [9]:
attendance_data.shape

(1120, 12)

In [10]:
attendance_data_trimmed = attendance_data.drop([0, 1, 2, 3, 4, 8, 9, 10], axis=1)

In [11]:
attendance_data_trimmed.shape

(1120, 4)

In [12]:
attendance_data_trimmed.head(5)

             5                 6           7   11
0  16SCSE101002  NISHCHHAL SHARMA  15/03/2019   1
1  16SCSE101002  NISHCHHAL SHARMA  12/03/2019   1
2  16SCSE101002  NISHCHHAL SHARMA  08/03/2019   1
3  16SCSE101002  NISHCHHAL SHARMA  12/03/2019   1
4  16SCSE101002  NISHCHHAL SHARMA  15/03/2019   1

In [13]:
attendance_data_trimmed.columns = ['RegistrationNo', 'StudentName', 'Date', 'ClassAttended']

In [14]:
attendance_data_trimmed.head(5)

  RegistrationNo       StudentName        Date  ClassAttended
0   16SCSE101002  NISHCHHAL SHARMA  15/03/2019              1
1   16SCSE101002  NISHCHHAL SHARMA  12/03/2019              1
2   16SCSE101002  NISHCHHAL SHARMA  08/03/2019              1
3   16SCSE101002  NISHCHHAL SHARMA  12/03/2019              1
4   16SCSE101002  NISHCHHAL SHARMA  15/03/2019              1

In [24]:
pivoted_Data = pd.pivot_table(attendance_data_trimmed, values='ClassAttended', index=['RegistrationNo', 'StudentName'], columns='Date', fill_value=0.0, aggfunc=np.sum)

In [25]:
attendance_data_pivoted = pd.DataFrame(pivoted_Data.to_records())

In [59]:
attendance_data_pivoted.head(5)

,RegistrationNo,StudentName,02/04/2019,08/03/2019,12/02/2019,12/03/2019,15/02/2019,15/03/2019,22/03/2019,26/02/2019,26/03/2019,29/01/2019,29/03/2019
0,16SCSE101002,NISHCHHAL SHARMA,2,2,2,2,2,2,0,0,2,0,2
1,16SCSE101005,NAMAN KAPOOR,2,2,0,2,2,0,0,0,2,0,2
2,16SCSE101012,ARNOB CHAKRABORTY,2,2,0,2,0,2,0,2,2,0,2
3,16SCSE101015,PRAGATI KUMARI,2,2,2,2,2,0,0,0,2,0,2
4,16SCSE101019,PRIYAMVADA SINGH,0,0,0,0,0,0,0,0,0,0,0

In [60]:
#result = attendance_data_pivoted[attendance_data_pivoted['RegistrationNo'] == '16SCSE102014'][['RegistrationNo', '15/03/2019']]


regNoIp = '16SCSE102014'
dateIp = '15/03/2019'
result = attendance_data_pivoted[attendance_data_pivoted['RegistrationNo'] == regNoIp][['RegistrationNo', dateIp]]

In [61]:
result

   RegistrationNo  15/03/2019
63   16SCSE102014           2

In [56]:
file = open("D:\\APP\\NITW\\Applications using Python\\Assignment_1\\Problem1\\output1.txt","w")

In [57]:
regNo = "".join(result['RegistrationNo'])
file.write(regNo+"\n")
classAttended = "".join(result['15/03/2019'].astype(str))
file.write(classAttended)

1

In [58]:
file.close()